def cleaner(word):
    all_letters = {'в', 'р', 'ы', 'а', 'ш', 'ю', 'и', 'б', 'ё', 'п', 'т', 'у', 'ч', 'я', 'ж', 'э', 'л', 'к', 'й', 'е',
                   'н', 'с', 'г', 'ф', 'м', 'д', 'х', 'о', 'ц', 'щ', 'з', 'В', 'Р', 'Ы', 'А', 'Ш', 'Ю', 'И', 'Б', 'Ё',
                   'П', 'Т', 'У', 'Ч', 'Я', 'Ж', 'Э', 'Л', 'К', 'Й', 'Е', 'Н', 'С', 'Г', 'Ф', 'М', 'Д', 'Х', 'О', 'Ц',
                   'Щ', 'З', 'J', 'Ü', 'a', 'ś', 'y', 'ź', 'n', 'Ż', 'H', 'E', 'G', 'Ź', 'X', 'Ó', 'ę', 'l', 'Ń', 'Y',
                   'Q', 'ó', 'Ś', 'u', 'v', 'U', 'h', 'ö', 'r', 'ń', 'M', 'P', 'C', 'x', 'z', 'ü', 'i', 'ż', 'g', 's',
                   'e', 'p', 'Ä', 'N', 'Z', 'R', 'm', 'q', 'o', 'ć', 'w', 'O', 'F', 'j', 'T', 'Ę', 'L', 'A', 't', 'k',
                   'D', 'ß', 'f', 'Ą', 'I', 'ä', 'Ć', 'S', 'c', 'ą', 'b', 'ł', 'Ł', 'K', 'Ö', 'B', 'd', 'W', 'V', ' ',
                   ',', '.', '/', '|'}
    return ''.join(tuple(filter(lambda x: x in all_letters, word))).strip()
